In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('tb.xlsx', sheet_name=None)

In [3]:
df.keys()

odict_keys(['tb_balances', 'tb_desc', 'fs_groupings'])

In [4]:
df_bal = df['tb_balances']
df_desc = df['tb_desc']
df_group = df['fs_groupings']

In [9]:
df_group.columns

Index(['Account', 'Financial Statement Grouping'], dtype='object')

In [5]:
df_bal.head()

   Account  Balance
0     1000    79256
1     1010    24498
2     1020   -54289
3     1030    76519
4     1040   -12535

In [11]:
# Merge dataframes to create complete set
df_new = df_bal.merge(df_desc, how='left', on='Account').merge(df_group, how='left', on='Account')

In [12]:
df_new.head()

,Account,Balance,Description,Financial Statement Grouping
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents
2,1020,-54289,Regular Checking Account,Cash and cash equivalents
3,1030,76519,Payroll Checking Account,Cash and cash equivalents
4,1040,-12535,Savings Account,Cash and cash equivalents

In [33]:
# Create fake prior year balances file to show merging two years using random and drop
import random
df_bal_py = df_bal.copy()
df_bal_py['Balance'] = [random.randint(-100000, 100000) for _ in range(len(df_bal_py))]

In [34]:
df_bal.head()

   Account  Balance
0     1000    79256
1     1010    24498
2     1020   -54289
3     1030    76519
4     1040   -12535

In [35]:
df_bal_py.head()

   Account  Balance
0     1000    73210
1     1010   -11512
2     1020   -84689
3     1030    66651
4     1040   -11359

In [36]:
df_bal_py = df_bal_py.drop([1, 3])

In [37]:
df_comp = df_bal.merge(df_bal_py, how='outer', on='Account', suffixes=('_CY', '_PY')).fillna(0)

In [38]:
df_comp.head()

   Account  Balance_CY  Balance_PY
0     1000       79256     73210.0
1     1010       24498         0.0
2     1020      -54289    -84689.0
3     1030       76519         0.0
4     1040      -12535    -11359.0

In [39]:
df_comp['Diff'] = df_comp['Balance_CY'] - df_comp['Balance_PY']
df_comp.head()

   Account  Balance_CY  Balance_PY     Diff
0     1000       79256     73210.0   6046.0
1     1010       24498         0.0  24498.0
2     1020      -54289    -84689.0  30400.0
3     1030       76519         0.0  76519.0
4     1040      -12535    -11359.0  -1176.0

In [40]:
df_comp_new = df_comp.merge(df_desc, how='left', on='Account').merge(df_group, how='left', on='Account')

In [41]:
df_comp_new.head()

,Account,Balance_CY,Balance_PY,Diff,Description,Financial Statement Grouping
0,1000,79256,73210.0,6046.0,Petty Cash,Cash and cash equivalents
1,1010,24498,0.0,24498.0,Cash on Hand (e.g. in cash registers),Cash and cash equivalents
2,1020,-54289,-84689.0,30400.0,Regular Checking Account,Cash and cash equivalents
3,1030,76519,0.0,76519.0,Payroll Checking Account,Cash and cash equivalents
4,1040,-12535,-11359.0,-1176.0,Savings Account,Cash and cash equivalents